; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=28, remove_proportion=0.2, bases=5, instance_id=15, output=./training, seed=56

(define (problem warehouse-15)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 - box
        base1 base2 base3 base4 base5 - base
    )
    (:init
        (to-remove box1)
        (to-remove box16)
        (to-remove box18)
        (to-remove box21)
        (to-remove box28)
        (clear box14)
        (on box14 box6)
        (on box6 box17)
        (on box17 box27)
        (on box27 box22)
        (on box22 box9)
        (on-base box9 base1)
        (clear box23)
        (on box23 box16)
        (on box16 box26)
        (on box26 box5)
        (on box5 box13)
        (on box13 box20)
        (on box20 box25)
        (on-base box25 base2)
        (clear box11)
        (on box11 box10)
        (on box10 box2)
        (on box2 box7)
        (on-base box7 base3)
        (clear box4)
        (on box4 box21)
        (on box21 box24)
        (on-base box24 base4)
        (clear box3)
        (on box3 box12)
        (on box12 box15)
        (on box15 box8)
        (on box8 box19)
        (on box19 box28)
        (on box28 box1)
        (on box1 box18)
        (on-base box18 base5)
    )
    (:goal (and 
        (removed box1)
        (removed box16)
        (removed box18)
        (removed box21)
        (removed box28)
    ))
)

; plan
1. (move box23 box16 box11)
   deleted: (clear box11) (on box23 box16)
   added: (on box23 box11) (clear box16)
   goals met: 0 of 5
2. (move box3 box12 box14)
   deleted: (clear box14) (on box3 box12)
   added: (on box3 box14) (clear box12)
   goals met: 0 of 5
3. (remove box16 box26)
   deleted: (on box16 box26) (clear box16)
   added: (removed box16) (clear box26)
   goals met: 1 of 5
4. (move box12 box15 box23)
   deleted: (clear box23) (on box12 box15)
   added: (on box12 box23) (clear box15)
   goals met: 1 of 5
5. (move box15 box8 box12)
   deleted: (clear box12) (on box15 box8)
   added: (on box15 box12) (clear box8)
   goals met: 1 of 5
6. (move box4 box21 box15)
   deleted: (clear box15) (on box4 box21)
   added: (on box4 box15) (clear box21)
   goals met: 1 of 5
7. (remove box21 box24)
   deleted: (on box21 box24) (clear box21)
   added: (removed box21) (clear box24)
   goals met: 2 of 5
8. (move box8 box19 box24)
   deleted: (clear box24) (on box8 box19)
   added: (on box8 box24) (clear box19)
   goals met: 2 of 5
9. (move box19 box28 box26)
   deleted: (clear box26) (on box19 box28)
   added: (on box19 box26) (clear box28)
   goals met: 2 of 5
10. (remove box28 box1)
   deleted: (on box28 box1) (clear box28)
   added: (removed box28) (clear box1)
   goals met: 3 of 5
11. (remove box1 box18)
   deleted: (on box1 box18) (clear box1)
   added: (removed box1) (clear box18)
   goals met: 4 of 5
12. (remove-from-base box18 base5)
   deleted: (on-base box18 base5) (clear box18)
   added: (removed box18) (clear-base base5)
   goals met: 5 of 5
